var list = [{
    "name": "上海",
    "Addr": "上海",
    "city": [{
            "name": "全部",
            "area": [ "全部"]
        },{
            "name": "浦东",
            "area": [ "北蔡", "周浦", "张江", "源深", "御桥", "洋泾", "杨东", "祝桥", "宣桥", "新场", "万祥镇", 
            "外高桥", "潍坊", "塘桥", "书院镇", "三林", "世博", "南码头", "联洋", "吴淞", "陆家嘴", "老港镇", "临港新城",
             "康桥", "金杨", "金桥",  "航头", "合庆", "惠南", "花木", "高行", "高东", "大团镇", "川沙", "曹路", "碧云"]
        }, {
            "name": "奉贤",
            "area": [ "奉城", "金汇", "海湾", "南桥", "青村", "四团", "西渡", "庄行", "柘林"]
       },{
            "name": "金山",
            "area": [ "漕泾", "枫泾", "金卫", "廊下", "吕巷", "石化", "亭林", "朱泾", "张堰", "山阳", "新城",]
       },  {
            "name": "闵行",
            "area": [ "颛桥", "莘庄", "吴泾", "七宝", "浦江", "马桥", "老闵行", "龙柏", "金虹桥", "金汇", "静安新城",
             "航华", "华漕", "古美", "春申"]
        }, {
            "name": "宝山",
            "area": [ "张庙", "月浦", "杨行", "通河", "淞南", "上大", "淞宝", "罗泾", "罗店", "高境", "共富", 
            "顾村", "大华", "大场镇"]
        }, {
            "name": "徐汇",
            "area": [ "漕河泾", "长桥", "华东理工", "华泾", "衡山路", "建国西路", "康健", "龙华", "上海南站", "田林", "万体馆", 
            "徐汇滨江", "徐家汇", "斜土路", "植物园"]
       }, {
            "name": "普陀",
            "area": [ "长风", "长寿路", "曹杨", "长征", "甘泉宜山", "光新", "桃浦", "万里", "武宁", "真光", "真如", 
            "中远两湾城"]
        }, {
            "name": "杨浦",
            "area": [ "鞍山", "东外滩", "黄兴公园", "控江路", "五角场", "新江湾城", "周家嘴路", "中原"]
        }, {
            "name": "长宁",
            "area": [ "北新泾", "古北", "虹桥", "天山", "新华路", "西郊", "仙霞", "镇宁路", "中三公园"]
       }, {
            "name": "松江",
            "area": [ "车墩", "九亭", "泖港", "石湖荡", "泗泾", "松江大学城", "松江老城", "松江新城", "佘山", "新滨", "小昆山", 
            "莘闵别墅", "新桥", "叶榭"]
       }, {
            "name": "嘉定",
            "area": [ "安亭", "丰庄", "华亭", "嘉定老城", "嘉定新城", "江桥", "菊园新区", "马陆", "南翔", "外冈", "新成路", 
            "徐行"]
       }, {
            "name": "黄浦",
            "area": [ "董家渡", "打浦桥", "黄海中路", "黄浦滨江", "老西门", "南京东路", "蓬莱公园", "人民广场", "世博滨江",
            "万里桥", "新天地", "豫园"]
        }, {
            "name": "静安",
            "area": [ "曹家渡", "静安寺", "江宁路", "南京西路"]
       }, {
            "name": "闸北",
            "area": [ "不夜城", "大宁", "西藏北路", "阳城", "永和", "闸北公园"]
       }, {
            "name": "虹口",
            "area": [ "北外滩", "江湾镇", "凉城", "临平路", "鲁迅公园", "曲阳", "四川北路"]
       }, {
            "name": "青浦",
            "area": [ "白鹤", "重固", "华新", "金泽", "练塘", "香花桥", "徐泾", "夏阳", "盈浦", "朱家角", "赵巷"]
       }, {
            "name": "崇明",
            "area": [ "堡镇", "陈家镇", "崇明其它", "崇明新城", "长兴岛", "横沙岛"]
       }, {
            "name": "上海周边",
            "area": [ "海门", "嘉兴", "昆山", "启动", "上海周边", "苏州", "太仓",]
       },

    ]
}];

var dtime = [{
        "name": "2016",
        "Addr": "2016",
        "city": [{
            "name": "全部",
            "area": [ "全部"]
        },
            { "name": "2016", "area": ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2017", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2018", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2019", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2020", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2021", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2022", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2023", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2024", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2025", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2026", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2027", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2028", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2029", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2030", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2031", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2032", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2033", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2034", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            { "name": "2035", "area": [ "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12",
             "上半年", "下半年", "第一季度", "第二季度", "第三季度", "第四季度"]},
            ]
    }
];

var sxcontent = [{
        "name": "2016",
        "Addr": "2016",
        "city": [{
            "name": "全部",
            "area": [ "全部"]
        },
            { "name": "面积", "area": mianji},
            { "name": "户型", "area": huxing},
            { "name": "风格", "area": zxstyle},
            ]
    }

]












